export const cityList = [
    { label: '台北市', value: 0 },
    { label: '新北市', value: 1 },
    { label: '桃園市', value: 2 },
    { label: '新竹縣', value: 3 },
    { label: '新竹市', value: 4 },
    { label: '基隆市', value: 5 },
    { label: '宜蘭市', value: 6 },
]

export const cityDistrictList = [
    [
        {
            label: '中正區',
            value: '100',
        },
        {
            label: '大同區',
            value: '103',
        },
        {
            label: '中山區',
            value: '104',
        },
        {
            label: '松山區',
            value: '105',
        },
        {
            label: '大安區',
            value: '106',
        },
        {
            label: '萬華區',
            value: '108',
        },
        {
            label: '信義區',
            value: '110',
        },
        {
            label: '士林區',
            value: '111',
        },
        {
            label: '北投區',
            value: '112',
        },
        {
            label: '內湖區',
            value: '114',
        },
        {
            label: '南港區',
            value: '115',
        },
        {
            label: '文山區',
            value: '116',
        },
    ],
    [
        {
            label: '萬里區',
            value: '207',
        },
        {
            label: '金山區',
            value: '208',
        },
        {
            label: '板橋區',
            value: '220',
        },
        {
            label: '汐止區',
            value: '221',
        },
        {
            label: '深坑區',
            value: '222',
        },
        {
            label: '石碇區',
            value: '223',
        },
        {
            label: '瑞芳區',
            value: '224',
        },
        {
            label: '平溪區',
            value: '226',
        },
        {
            label: '雙溪區',
            value: '227',
        },
        {
            label: '貢寮區',
            value: '228',
        },
        {
            label: '新店區',
            value: '231',
        },
        {
            label: '坪林區',
            value: '232',
        },
        {
            label: '烏來區',
            value: '233',
        },
        {
            label: '永和區',
            value: '234',
        },
        {
            label: '中和區',
            value: '235',
        },
        {
            label: '土城區',
            value: '236',
        },
        {
            label: '三峽區',
            value: '237',
        },
        {
            label: '樹林區',
            value: '238',
        },
        {
            label: '鶯歌區',
            value: '239',
        },
        {
            label: '三重區',
            value: '241',
        },
        {
            label: '新莊區',
            value: '242',
        },
        {
            label: '泰山區',
            value: '243',
        },
        {
            label: '林口區',
            value: '244',
        },
        {
            label: '蘆洲區',
            value: '247',
        },
        {
            label: '五股區',
            value: '248',
        },
        {
            label: '八里區',
            value: '249',
        },
        {
            label: '淡水區',
            value: '251',
        },
        {
            label: '三芝區',
            value: '252',
        },
        {
            label: '石門區',
            value: '253',
        },
    ],
    [
        {
            label: '中壢區',
            value: '320',
        },
        {
            label: '平鎮區',
            value: '324',
        },
        {
            label: '龍潭區',
            value: '325',
        },
        {
            label: '楊梅區',
            value: '326',
        },
        {
            label: '新屋區',
            value: '327',
        },
        {
            label: '觀音區',
            value: '328',
        },
        {
            label: '桃園區',
            value: '330',
        },
        {
            label: '龜山區',
            value: '333',
        },
        {
            label: '八德區',
            value: '334',
        },
        {
            label: '大溪區',
            value: '335',
        },
        {
            label: '復興區',
            value: '336',
        },
        {
            label: '大園區',
            value: '337',
        },
        {
            label: '蘆竹區',
            value: '338',
        },
    ],
    [
        {
            label: '竹北市',
            value: '302',
        },
        {
            label: '湖口鄉',
            value: '303',
        },
        {
            label: '新豐鄉',
            value: '304',
        },
        {
            label: '新埔鎮',
            value: '305',
        },
        {
            label: '關西鎮',
            value: '306',
        },
        {
            label: '芎林鄉',
            value: '307',
        },
        {
            label: '寶山鄉',
            value: '308',
        },
        {
            label: '竹東鎮',
            value: '310',
        },
        {
            label: '五峰鄉',
            value: '311',
        },
        {
            label: '橫山鄉',
            value: '312',
        },
        {
            label: '尖石鄉',
            value: '313',
        },
        {
            label: '北埔鄉',
            value: '314',
        },
        {
            label: '峨眉鄉',
            value: '315',
        },
    ],
    [
        {
            label: '香山區',
            value: '300',
        },
        {
            label: '東區',
            value: '30002',
        },
        {
            label: '北區',
            value: '30003',
        },
    ],
    [
        {
            label: '仁愛區',
            value: '200',
        },
        {
            label: '信義區',
            value: '201',
        },
        {
            label: '中正區',
            value: '202',
        },
        {
            label: '中山區',
            value: '203',
        },
        {
            label: '安樂區',
            value: '204',
        },
        {
            label: '暖暖區',
            value: '205',
        },
        {
            label: '七堵區',
            value: '206',
        },
    ],
    [
        {
            label: '宜蘭市',
            value: '260',
        },
        {
            label: '頭城鎮',
            value: '261',
        },
        {
            label: '礁溪鄉',
            value: '262',
        },
        {
            label: '壯圍鄉',
            value: '263',
        },
        {
            label: '員山鄉',
            value: '264',
        },
        {
            label: '羅東鎮',
            value: '265',
        },
        {
            label: '三星鄉',
            value: '266',
        },
        {
            label: '大同鄉',
            value: '267',
        },
        {
            label: '五結鄉',
            value: '268',
        },
        {
            label: '冬山鄉',
            value: '269',
        },
        {
            label: '蘇澳鎮',
            value: '270',
        },
        {
            label: '南澳鄉',
            value: '272',
        },
        {
            label: '釣魚臺',
            value: '290',
        },
    ],
]

export const northTaiwanCitiesTable = {
    0: '台北市',
    1: '新北市',
    2: '桃園市',
    3: '新竹縣',
    4: '新竹市',
    5: '基隆市',
    6: '宜蘭市',
}

export const northTaiwanDistrictsTable = {
    0: {
        100: '中正區',
        103: '大同區',
        104: '中山區',
        105: '松山區',
        106: '大安區',
        108: '萬華區',
        110: '信義區',
        111: '士林區',
        112: '北投區',
        114: '內湖區',
        115: '南港區',
        116: '文山區',
    },
    1: {
        207: '萬里區',
        208: '金山區',
        220: '板橋區',
        221: '汐止區',
        222: '深坑區',
        223: '石碇區',
        224: '瑞芳區',
        226: '平溪區',
        227: '雙溪區',
        228: '貢寮區',
        231: '新店區',
        232: '坪林區',
        233: '烏來區',
        234: '永和區',
        235: '中和區',
        236: '土城區',
        237: '三峽區',
        238: '樹林區',
        239: '鶯歌區',
        241: '三重區',
        242: '新莊區',
        243: '泰山區',
        244: '林口區',
        247: '蘆洲區',
        248: '五股區',
        249: '八里區',
        251: '淡水區',
        252: '三芝區',
        253: '石門區',
    },
    2: {
        320: '中壢區',
        324: '平鎮區',
        325: '龍潭區',
        326: '楊梅區',
        327: '新屋區',
        328: '觀音區',
        330: '桃園區',
        333: '龜山區',
        334: '八德區',
        335: '大溪區',
        336: '復興區',
        337: '大園區',
        338: '蘆竹區',
    },
    3: {
        302: '竹北市',
        303: '湖口鄉',
        304: '新豐鄉',
        305: '新埔鎮',
        306: '關西鎮',
        307: '芎林鄉',
        308: '寶山鄉',
        310: '竹東鎮',
        311: '五峰鄉',
        312: '橫山鄉',
        313: '尖石鄉',
        314: '北埔鄉',
        315: '峨眉鄉',
    },
    4: { 300: '香山區', 30002: '東區', 30003: '北區' },
    5: {
        200: '仁愛區',
        201: '信義區',
        202: '中正區',
        203: '中山區',
        204: '安樂區',
        205: '暖暖區',
        206: '七堵區',
    },
    6: {
        260: '宜蘭市',
        261: '頭城鎮',
        262: '礁溪鄉',
        263: '壯圍鄉',
        264: '員山鄉',
        265: '羅東鎮',
        266: '三星鄉',
        267: '大同鄉',
        268: '五結鄉',
        269: '冬山鄉',
        270: '蘇澳鎮',
        272: '南澳鄉',
        290: '釣魚臺',
    },
}
